app/Controllers/agentinvoice.php

SELECT `sub_agent`.`name`, `sub_agent`.`gst_no`, `sub_agent`.`address`
FROM `sub_agent`
JOIN `agent_master` ON `agent_master`.`id` = `sub_agent`.`agent_id`
WHERE `agent_master`.`user_id` = 'FIN23A0'
---
            public function comparedate()
            {
                $fromDate = $this->request->getVar('fromdate');
                $toDate = $this->request->getVar('todate');
                $agentId = $this->request->getVar('agentname');

                // Create an instance of the Paymentmodel
                $this->payment = new Paymentmodel();
                $db = db_connect(); // Assuming you are using CodeIgniter 4

                // Fetch data from sub_agent table
                $subAgentData = $db->table('sub_agent')
                                   ->select('sub_agent.name, sub_agent.gst_no ,sub_agent.address') // Select both name and gst_no
                                   ->join('agent_master', 'agent_master.id = sub_agent.agent_id')
                                   ->where('agent_master.user_id', $agentId)
                                   ->get()
                                   ->getResultArray();

SELECT *
FROM `generate_invoice`
WHERE `id` = '10'
 LIMIT 1
---
    public function getInvoiceData()
    {
        $id = $this->request->getVar('id');

        $this->invoiceModel = new GenerateInvoiceModel();

        $data = $this->invoiceModel->where('id', $id)->first();