app/Controllers/paymentcontroller.php

SELECT *
FROM `payment`
WHERE `status` = 1
---
    public function payment_display()
    {
        $data['pageTitle'] = 'Payment';
        $agentModel = new AgentModel();
        $this->payment = new Paymentmodel();
        $data['agent_id'] = $agentModel->findAll();
        $data['payment'] = $this->payment->where('status', 1)->get()->getResultArray();