app/Models/GenerateInvoiceModel.php

    public function insertSubagentData($data)
    {
        $this->insert($data);
        return $this->find($this->insertID());
---
INSERT INTO `generate_invoice` (`agentName`, `agent_id`, `email`, `tds`, `netPayment`, `invoice_no`, `gst_no`, `date`, `address`, `payment_mode`, `grossPayout`, `payableAmount`, `cgst`, `sgst`, `igst`, `fromdate`, `todate`, `commision`) VALUES ('Balraj', 'FIN23A0', 'anita.glansa@gmail.com', '21402.80', '406653.2', 'IN 02/08/2025 33', 'jnjnjnjnjnjnjn', '8/2/2025', 'hyderabad, Telangana', 'phone_pay', '428056', '428056', '38525.04', '38525.04', '77050.08', '2023-02-01', '2023-08-31', '406653.2')
SELECT *
FROM `generate_invoice`
WHERE `generate_invoice`.`id` = 1

    public function checkDataExists($agentId, $fromDate, $toDate)
    {
        $existingRow = $this->where('agent_id', $agentId)
                            ->where('fromdate >=', $fromDate)
                            ->where('todate <=', $toDate)
                            ->findAll();
---
SELECT *
FROM `generate_invoice`
WHERE `agent_id` = 'FIN23A0'
AND `fromdate` >= '2023-07-01'
AND `todate` <= '2023-08-31'