app/Models/SubAgentModel.php

SELECT COUNT(*) AS `numrows` FROM `sub_agent`
---
    public function getCountOfsubAgent()
    {
        return $this->countAll();